GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_spi.c
/*
 * Copyright (c) 2017-2018 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0xx.h"

#include "stm32l0_gpio.h"
#include "stm32l0_spi.h"
#include "stm32l0_dma.h"
#include "stm32l0_exti.h"
#include "stm32l0_system.h"

typedef struct _stm32l0_spi_device_t {
    stm32l0_spi_t     *instances[STM32L0_SPI_INSTANCE_COUNT];
} stm32l0_spi_device_t;

#define STM32L0_SPI_RX_DMA_OPTION_RECEIVE_8         \
    (STM32L0_DMA_OPTION_PERIPHERAL_TO_MEMORY |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |     \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_SPI_TX_DMA_OPTION_RECEIVE_8         \
    (STM32L0_DMA_OPTION_MEMORY_TO_PERIPHERAL |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_SPI_RX_DMA_OPTION_TRANSMIT_8        \
    (STM32L0_DMA_OPTION_PERIPHERAL_TO_MEMORY |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_SPI_TX_DMA_OPTION_TRANSMIT_8        \
    (STM32L0_DMA_OPTION_MEMORY_TO_PERIPHERAL |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |     \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_SPI_RX_DMA_OPTION_TRANSFER_8        \
    (STM32L0_DMA_OPTION_PERIPHERAL_TO_MEMORY |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |     \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

#define STM32L0_SPI_TX_DMA_OPTION_TRANSFER_8        \
    (STM32L0_DMA_OPTION_MEMORY_TO_PERIPHERAL |      \
     STM32L0_DMA_OPTION_PERIPHERAL_DATA_SIZE_16 |   \
     STM32L0_DMA_OPTION_MEMORY_DATA_SIZE_8 |        \
     STM32L0_DMA_OPTION_MEMORY_DATA_INCREMENT |     \
     STM32L0_DMA_OPTION_PRIORITY_MEDIUM)

static stm32l0_spi_device_t stm32l0_spi_device;

static void stm32l0_spi_dma_callback(stm32l0_spi_t *spi, uint32_t events)
{
    SPI_TypeDef *SPI = spi->SPI;

    if (armv6m_atomic_casb(&spi->state, STM32L0_SPI_STATE_DMA, STM32L0_SPI_STATE_DATA) != STM32L0_SPI_STATE_DMA)
    {
        return;
    }

    while (!(SPI->SR & SPI_SR_TXE))
    {
    }
    
    SPI->CR1 &= ~SPI_CR1_SPE;

    while (SPI->SR & SPI_SR_BSY)
    {
    }
    
    SPI->CR2 = 0;
    SPI->CR1 |= SPI_CR1_SPE;
    
    if (spi->xf_callback)
    {
        (*spi->xf_callback)(spi->xf_context);
    }
}

bool stm32l0_spi_create(stm32l0_spi_t *spi, const stm32l0_spi_params_t *params)
{
    if (spi->state != STM32L0_SPI_STATE_NONE)
    {
        return false;
    }

    spi->SPI = (params->instance == STM32L0_SPI_INSTANCE_SPI1) ? SPI1 : SPI2;
    spi->instance = params->instance;
    spi->priority = params->priority;
    spi->rx_dma = params->rx_dma;
    spi->tx_dma = params->tx_dma;
    spi->pins = params->pins;
    spi->tx_default = 0xff;
    
    stm32l0_spi_device.instances[spi->instance] = spi;

    spi->state = STM32L0_SPI_STATE_INIT;

    return true;
}

bool stm32l0_spi_destroy(stm32l0_spi_t *spi)
{
    if (spi->state != STM32L0_SPI_STATE_INIT)
    {
        return false;
    }

    spi->state = STM32L0_SPI_STATE_NONE;

    stm32l0_spi_device.instances[spi->instance] = NULL;

    return true;
}

bool stm32l0_spi_enable(stm32l0_spi_t *spi)
{
    if (spi->state != STM32L0_SPI_STATE_INIT)
    {
        if (spi->state == STM32L0_SPI_STATE_READY)
        {
            spi->nesting++;

            return true;
        }
        else
        {
            return false;
        }
    }

    spi->nesting = 1;
    spi->clock = 0;
    spi->option = ~0;
    spi->mask = 0;
    spi->lck_callback = NULL;
    spi->lck_context = NULL;
    
    stm32l0_gpio_pin_configure(spi->pins.mosi, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_VERY_HIGH | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_ALTERNATE));
    stm32l0_gpio_pin_configure(spi->pins.miso, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_VERY_HIGH | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_ALTERNATE));
    stm32l0_gpio_pin_configure(spi->pins.sck,  (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_PUPD_NONE | STM32L0_GPIO_OSPEED_VERY_HIGH | STM32L0_GPIO_OTYPE_PUSHPULL | STM32L0_GPIO_MODE_ALTERNATE));

    spi->state = STM32L0_SPI_STATE_READY;

