GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_spi.c
    return true;
}

bool stm32l0_spi_disable(stm32l0_spi_t *spi)
{
    if (spi->state != STM32L0_SPI_STATE_READY)
    {
        return false;
    }

    if (spi->nesting != 1)
    {
        spi->nesting--;
    }
    else
    {
        spi->nesting = 0;

        stm32l0_gpio_pin_configure(spi->pins.mosi, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_MODE_ANALOG));
        stm32l0_gpio_pin_configure(spi->pins.miso, (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_MODE_ANALOG));
        stm32l0_gpio_pin_configure(spi->pins.sck,  (STM32L0_GPIO_PARK_HIZ | STM32L0_GPIO_MODE_ANALOG));
        
        stm32l0_spi_device.instances[spi->instance] = NULL;
        
        spi->state = STM32L0_SPI_STATE_INIT;
    }

    return true;
}

bool stm32l0_spi_hook(stm32l0_spi_t *spi, stm32l0_spi_lock_callback_t callback, void *context)
{
    if (spi->state != STM32L0_SPI_STATE_READY)
    {
        return false;
    }

    spi->lck_callback = callback;
    spi->lck_context = context;

    return true;
}

bool stm32l0_spi_block(stm32l0_spi_t *spi, uint16_t pin)
{
    if (spi->state != STM32L0_SPI_STATE_READY)
    {
        return false;
    }

    spi->mask |= (1ul << ((pin & STM32L0_GPIO_PIN_INDEX_MASK) >> STM32L0_GPIO_PIN_INDEX_SHIFT));

    return true;
}

bool stm32l0_spi_unblock(stm32l0_spi_t *spi, uint16_t pin)
{
    if (spi->state != STM32L0_SPI_STATE_READY)
    {
        return false;
    }

    spi->mask &= ~(1ul << ((pin & STM32L0_GPIO_PIN_INDEX_MASK) >> STM32L0_GPIO_PIN_INDEX_SHIFT));

    return true;
}

bool stm32l0_spi_acquire(stm32l0_spi_t *spi, uint32_t clock, uint32_t option)
{
    SPI_TypeDef *SPI = spi->SPI;
    uint32_t pclk, spiclk, div;

    if (spi->state != STM32L0_SPI_STATE_READY)
    {
        return false;
    }

    if (spi->lck_callback)
    {
        (*spi->lck_callback)(spi->lck_context, true);
    }

    if (spi->mask)
    {
        stm32l0_exti_block(spi->mask);
    }

    stm32l0_system_lock(STM32L0_SYSTEM_LOCK_RUN);

    stm32l0_system_periph_enable(STM32L0_SYSTEM_PERIPH_SPI1 + spi->instance);

    if (spi->rx_dma != STM32L0_DMA_CHANNEL_NONE)
    {
        stm32l0_dma_enable(spi->rx_dma, (stm32l0_dma_callback_t)stm32l0_spi_dma_callback, spi);
    }
    
    if (spi->tx_dma != STM32L0_DMA_CHANNEL_NONE)
    {
        stm32l0_dma_enable(spi->tx_dma, NULL, NULL);
    }

    if (spi->instance == STM32L0_SPI_INSTANCE_SPI1)
    {
        pclk = stm32l0_system_pclk2();
    }
    else
    {
        pclk = stm32l0_system_pclk1();
    }

    if (spi->pclk != pclk)
    {
        spi->pclk = pclk;
        spi->clock = 0;
        spi->option = ~0;
    }

    if ((spi->clock != clock) || ((spi->option ^ option) & (SPI_CR1_CPHA | SPI_CR1_CPOL | SPI_CR1_LSBFIRST)))
    {
        spiclk = spi->pclk / 2;
        div = 0;

        while ((spiclk > clock) && (div < 7))
        {
            spiclk >>= 1;
            div++;
        }
    
        SPI->CR1 &= ~SPI_CR1_SPE;
        SPI->SR = 0;
        SPI->CRCPR = 0x1021;
        SPI->CR1 = SPI_CR1_MSTR | SPI_CR1_SSM | SPI_CR1_SSI | (option & (STM32L0_SPI_OPTION_MODE_MASK | STM32L0_SPI_OPTION_LSB_FIRST)) | (div << SPI_CR1_BR_Pos);
        SPI->CR2 = 0;

        spi->clock = clock;
    }

    spi->option = option;

    SPI->CR1 |= SPI_CR1_SPE;

    spi->state = STM32L0_SPI_STATE_DATA;

    return true;
}

bool stm32l0_spi_release(stm32l0_spi_t *spi)
{
    SPI_TypeDef *SPI = spi->SPI;

    if (spi->state != STM32L0_SPI_STATE_DATA)
    {
        return false;
    }

    while (SPI->SR & SPI_SR_BSY)
    {
    }

    SPI->CR1 &= ~SPI_CR1_SPE;

    if (spi->rx_dma == stm32l0_dma_channel(spi->rx_dma))
    {
        stm32l0_dma_disable(spi->rx_dma);
    }
    
    if (spi->tx_dma == stm32l0_dma_channel(spi->tx_dma))
    {
        stm32l0_dma_disable(spi->tx_dma);
    }

    stm32l0_system_periph_disable(STM32L0_SYSTEM_PERIPH_SPI1 + spi->instance);

    stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_RUN);

    if (spi->mask)
    {
        stm32l0_exti_unblock(spi->mask);
    }

    if (spi->lck_callback)
    {
        (*spi->lck_callback)(spi->lck_context, false);
    }

    spi->state = STM32L0_SPI_STATE_READY;

    return true;
}

__attribute__((optimize("O3"))) void stm32l0_spi_data(stm32l0_spi_t *spi, const uint8_t *tx_data, uint8_t *rx_data, uint32_t xf_count)
{
    SPI_TypeDef *SPI = spi->SPI;
    const uint8_t *tx_data_e;
    uint8_t *rx_data_e;
    uint8_t rx_temp, tx_temp, tx_default;

    if (tx_data)
    {
        if (rx_data)
        {
            if ((xf_count <= 16) || (spi->rx_dma != stm32l0_dma_channel(spi->rx_dma)))
            {
                if (xf_count == 1)
                {
                    SPI->DR = *tx_data;
        
                    while (!(SPI->SR & SPI_SR_RXNE))
                    {
                    }
        
                    *rx_data = SPI->DR;
                }
                else
                {
                    tx_data_e = tx_data + xf_count;
        
                    SPI->DR = *tx_data++;
        
                    do 
                    {
                        tx_temp = *tx_data++;
            
                        __asm__ volatile("": : : "memory");
            
                        while (!(SPI->SR & SPI_SR_RXNE))
                        {
                        }
            
                        rx_temp = SPI->DR;
                        SPI->DR = tx_temp;
            
                        __asm__ volatile("": : : "memory");
            
                        *rx_data++ = rx_temp;
                    } 
                    while (tx_data != tx_data_e);
        
                    while (!(SPI->SR & SPI_SR_RXNE))
                    {
                    }
        
                    *rx_data++ = SPI->DR;
                }
            }
            else
            {
                if (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma))
                {
                    SPI->CR1 &= ~SPI_CR1_SPE;
                    SPI->CR2 = SPI_CR2_RXDMAEN;
                    SPI->CR1 |= SPI_CR1_SPE;
            
                    stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_TRANSFER_8);

