GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_spi.c
                    tx_data_e = tx_data + xf_count;
            
                    SPI->DR = *tx_data++;
            
                    do 
                    {
                        tx_temp = *tx_data++;
                
                        __asm__ volatile("": : : "memory");
                
                        while (!(SPI->SR & SPI_SR_TXE))
                        {
                        }
                
                        SPI->DR = tx_temp;
                
                        __asm__ volatile("": : : "memory");
                    } 
                    while (tx_data != tx_data_e);
            
                    while (!stm32l0_dma_done(spi->rx_dma))
                    {
                    }
            
                    stm32l0_dma_stop(spi->rx_dma);
                }
                else
                {
                    SPI->CR1 &= ~SPI_CR1_SPE;
                    SPI->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN;
                    SPI->CR1 |= SPI_CR1_SPE;
            
                    stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_TRANSFER_8);
                    stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)tx_data, xf_count, STM32L0_SPI_TX_DMA_OPTION_TRANSFER_8);
            
                    while (!stm32l0_dma_done(spi->rx_dma))
                    {
                    }
            
                    stm32l0_dma_stop(spi->rx_dma);
                    stm32l0_dma_stop(spi->tx_dma);
                }
            
                while (!(SPI->SR & SPI_SR_TXE))
                {
                }
        
                SPI->CR1 &= ~SPI_CR1_SPE;

                while (SPI->SR & SPI_SR_BSY)
                {
                }
        
                SPI->CR2 = 0;
                SPI->CR1 |= SPI_CR1_SPE;
            }
        }
        else
        {
            if ((xf_count <= 16) || (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma)))
            {
                if (xf_count == 1)
                {
                    SPI->DR = *tx_data;
                }
                else
                {
                    tx_data_e = tx_data + xf_count;
                    
                    SPI->DR = *tx_data++;
                    
                    do 
                    {
                        tx_temp = *tx_data++;
                        
                        __asm__ volatile("": : : "memory");
                        
                        while (!(SPI->SR & SPI_SR_TXE))
                        {
                        }
                        
                        SPI->DR = tx_temp;
                        
                        __asm__ volatile("": : : "memory");
                    } 
                    while (tx_data != tx_data_e);
                }
                
                while (!(SPI->SR & SPI_SR_TXE))
                {
                }
                
                while (SPI->SR & SPI_SR_BSY)
                {
                }
                
                SPI->DR;
                SPI->SR;
            }
            else
            {
                SPI->CR1 &= ~SPI_CR1_SPE;
                SPI->CR2 = SPI_CR2_TXDMAEN;
                SPI->CR1 |= SPI_CR1_SPE;
                
                stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)tx_data, xf_count, STM32L0_SPI_TX_DMA_OPTION_TRANSMIT_8);
                
                while (!stm32l0_dma_done(spi->tx_dma))
                {
                }
                
                stm32l0_dma_stop(spi->tx_dma);
                
                while (!(SPI->SR & SPI_SR_TXE))
                {
                }
                
                SPI->CR1 &= ~SPI_CR1_SPE;

                while (SPI->SR & SPI_SR_BSY)
                {
                }
                
                SPI->CR2 = 0;
                SPI->CR1 |= SPI_CR1_SPE;
                
                SPI->DR;
                SPI->SR;
            }
        }
    }
    else
    {
        tx_default = 0xff;

        if ((xf_count <= 16) || (spi->rx_dma != stm32l0_dma_channel(spi->rx_dma)))
        {
            if (xf_count == 1)
            {
                SPI->DR = tx_default;
        
                while (!(SPI->SR & SPI_SR_RXNE))
                {
                }
        
                *rx_data = SPI->DR;
            }
            else
            {
                rx_data_e = rx_data + xf_count -1;
        
                SPI->DR = tx_default;
        
                do 
                {
                    __asm__ volatile("": : : "memory");
            
                    while (!(SPI->SR & SPI_SR_RXNE))
                    {
                    }
            
                    rx_temp = SPI->DR;
                    SPI->DR = tx_default;
            
                    __asm__ volatile("": : : "memory");
            
                    *rx_data++ = rx_temp;
                } 
                while (rx_data != rx_data_e);
        
                while (!(SPI->SR & SPI_SR_RXNE))
                {
                }
        
                *rx_data++ = SPI->DR;
            }
        }
        else
        {
            if (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma))
            {
                SPI->CR1 &= ~SPI_CR1_SPE;
                SPI->CR2 = SPI_CR2_RXDMAEN;
                SPI->CR1 |= SPI_CR1_SPE;
                
                stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_RECEIVE_8);

                do
                {
                    while (!(SPI->SR & SPI_SR_TXE))
                    {
                    }
                    
                    SPI->DR = tx_default;
                }
                while (--xf_count);

                while (!stm32l0_dma_done(spi->rx_dma))
                {
                }
                
                stm32l0_dma_stop(spi->rx_dma);
            }
            else
            {
                SPI->CR1 &= ~SPI_CR1_SPE;
                SPI->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN;
                SPI->CR1 |= SPI_CR1_SPE;
                
