GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_spi.c
                stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_RECEIVE_8);
                stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)&spi->tx_default, xf_count, STM32L0_SPI_TX_DMA_OPTION_RECEIVE_8);
                
                while (!stm32l0_dma_done(spi->rx_dma))
                {
                }
                
                stm32l0_dma_stop(spi->rx_dma);
                stm32l0_dma_stop(spi->tx_dma);
            }
                
            while (!(SPI->SR & SPI_SR_TXE))
            {
            }
            
            SPI->CR1 &= ~SPI_CR1_SPE;

            while (SPI->SR & SPI_SR_BSY)
            {
            }
            
            SPI->CR2 = 0;
            SPI->CR1 |= SPI_CR1_SPE;
        }
    }
}

__attribute__((optimize("O3"))) uint8_t stm32l0_spi_data8(stm32l0_spi_t *spi, uint8_t data)
{
    SPI_TypeDef *SPI = spi->SPI;

    SPI->DR = data;
        
    while (!(SPI->SR & SPI_SR_RXNE))
    {
    }

    data = SPI->DR;
        
    return data;
}

__attribute__((optimize("O3"))) uint16_t stm32l0_spi_data16(stm32l0_spi_t *spi, uint16_t data)
{
    SPI_TypeDef *SPI = spi->SPI;
    uint8_t rx_temp, tx_temp;

    if (spi->option & STM32L0_SPI_OPTION_LSB_FIRST)
    {
        SPI->DR = ((const uint8_t*)&data)[0];

        tx_temp = ((const uint8_t*)&data)[1];

        __asm__ volatile("": : : "memory");
        
        while (!(SPI->SR & SPI_SR_RXNE))
        {
        }

        rx_temp = SPI->DR;
        SPI->DR = tx_temp;

        __asm__ volatile("": : : "memory");

        ((uint8_t*)&data)[0] = rx_temp;

        while (!(SPI->SR & SPI_SR_RXNE))
        {
        }

        ((uint8_t*)&data)[1] = SPI->DR;
    }
    else
    {
        SPI->DR = ((const uint8_t*)&data)[1];

        tx_temp = ((const uint8_t*)&data)[0];

        __asm__ volatile("": : : "memory");
        
        while (!(SPI->SR & SPI_SR_RXNE))
        {
        }

        rx_temp = SPI->DR;
        SPI->DR = tx_temp;

        __asm__ volatile("": : : "memory");

        ((uint8_t*)&data)[1] = rx_temp;

        while (!(SPI->SR & SPI_SR_RXNE))
        {
        }

        ((uint8_t*)&data)[0] = SPI->DR;
    }

    return data;
}

bool stm32l0_spi_receive(stm32l0_spi_t *spi, uint8_t *rx_data, uint32_t xf_count, stm32l0_spi_done_callback_t callback, void *context)
{
    SPI_TypeDef *SPI = spi->SPI;

    if (spi->state != STM32L0_SPI_STATE_DATA)
    {
        return false;
    }

    if ((spi->rx_dma != stm32l0_dma_channel(spi->rx_dma)) || (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma)))
    {
        return false;
    }

    spi->state = STM32L0_SPI_STATE_DMA;
    spi->xf_callback = callback;
    spi->xf_context = context;
    spi->rx_data = rx_data;
    
    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN;
    SPI->CR1 |= SPI_CR1_SPE;
            
    stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_RECEIVE_8 | STM32L0_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)&spi->tx_default, xf_count, STM32L0_SPI_TX_DMA_OPTION_RECEIVE_8);
    
    return true;
}

bool stm32l0_spi_transmit(stm32l0_spi_t *spi, const uint8_t *tx_data, uint32_t xf_count, stm32l0_spi_done_callback_t callback, void *context)
{
    SPI_TypeDef *SPI = spi->SPI;

    if (spi->state != STM32L0_SPI_STATE_DATA)
    {
        return false;
    }

    if ((spi->rx_dma != stm32l0_dma_channel(spi->rx_dma)) || (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma)))
    {
        return false;
    }

    spi->state = STM32L0_SPI_STATE_DMA;
    spi->xf_callback = callback;
    spi->xf_context = context;
    spi->rx_data = NULL;

    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN;
    SPI->CR1 |= SPI_CR1_SPE;
            
    stm32l0_dma_start(spi->rx_dma, (uint32_t)&spi->rx_none, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_TRANSMIT_8 | STM32L0_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)tx_data, xf_count, STM32L0_SPI_TX_DMA_OPTION_TRANSMIT_8);
    
    return true;
}

bool stm32l0_spi_transfer(stm32l0_spi_t *spi, const uint8_t *tx_data, uint8_t *rx_data, uint32_t xf_count, stm32l0_spi_done_callback_t callback, void *context)
{
    SPI_TypeDef *SPI = spi->SPI;

    if ((spi->rx_dma != stm32l0_dma_channel(spi->rx_dma)) || (spi->tx_dma != stm32l0_dma_channel(spi->tx_dma)))
    {
        return false;
    }

    if (armv6m_atomic_casb(&spi->state, STM32L0_SPI_STATE_DATA, STM32L0_SPI_STATE_DMA) != STM32L0_SPI_STATE_DATA)
    {
        return false;
    }

    spi->xf_callback = callback;
    spi->xf_context = context;
    spi->rx_data = rx_data;

    SPI->CR1 &= ~SPI_CR1_SPE;
    SPI->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN;
    SPI->CR1 |= SPI_CR1_SPE;
            
    stm32l0_dma_start(spi->rx_dma, (uint32_t)rx_data, (uint32_t)&SPI->DR, xf_count, STM32L0_SPI_RX_DMA_OPTION_TRANSFER_8 | STM32L0_DMA_OPTION_EVENT_TRANSFER_DONE);
    stm32l0_dma_start(spi->tx_dma, (uint32_t)&SPI->DR, (uint32_t)tx_data, xf_count, STM32L0_SPI_TX_DMA_OPTION_TRANSFER_8);
    
    return true;
}

uint32_t stm32l0_spi_cancel(stm32l0_spi_t *spi)
{
    SPI_TypeDef *SPI = spi->SPI;
    uint32_t xf_count;
    uint8_t rx_data;
   
    if (armv6m_atomic_casb(&spi->state, STM32L0_SPI_STATE_DMA, STM32L0_SPI_STATE_DATA) != STM32L0_SPI_STATE_DMA)
    {
        return 0;
    }

    stm32l0_dma_stop(spi->tx_dma);
    
    while (!(SPI->SR & SPI_SR_TXE))
    {
    }
    
    SPI->CR1 &= ~SPI_CR1_SPE;

    while (SPI->SR & SPI_SR_BSY)
    {
    }
    
    SPI->CR2 = 0;

    xf_count = stm32l0_dma_stop(spi->rx_dma);
        
    while (!(SPI->SR & SPI_SR_RXNE))
    {
        rx_data = SPI->DR;
            
        if (spi->rx_data)
        {
            spi->rx_data[xf_count] = rx_data;
        }
        
        xf_count++;
    }

    SPI->CR1 |= SPI_CR1_SPE;

    return xf_count;
}

bool stm32l0_spi_done(stm32l0_spi_t *spi)
{
    return (spi->state != STM32L0_SPI_STATE_DMA);
}
